module.exports = function obfuscateArabic(text) {
  const map = {
    "ا": "ـ9",
    "أ": "ـ9",
    "إ": "ـ9",
    "ب": "بـ9",
    "ت": "تـ9",
    "ث": "ثـ9",
    "ج": "جـ3",
    "ح": "حـ1",
    "خ": "خـ1",
    "س": "سـ3",
    "ش": "شـ&",
    "ص": "صـ9",
    "ض": "ضـ9",
    "ط": "طـ6",
    "ع": "عـ7",
    "ف": "فـ9",
    "ق": "قـ8",
    "ك": "كـ9",
    "ل": "لـ1",
    "م": "مـz",
    "ن": "نـ2",
    "ه": "هـ9",
    "و": "وـ9",
    "ي": "يـ9"
  };

  return text
    .split("")
    .map(char => map[char] || char)
    .join("");
};
