// utils/obfuscateArabic.js

const map = {
  "ا": "ـ9",
  "أ": "ـ9",
  "إ": "ـ9",
  "ب": "ـ9",
  "ت": "ـ9",
  "ث": "ـ9",
  "ج": "ـج",
  "ح": "ـح",
  "خ": "خـ1",
  "د": "د",
  "ذ": "ذ",
  "ر": "ر",
  "ز": "ز",
  "س": "سـ3ـ",
  "ش": "شـ&ـ",
  "ص": "ص",
  "ض": "ض",
  "ط": "ط",
  "ظ": "ظ",
  "ع": "ع",
  "غ": "غ",
  "ف": "ف",
  "ق": "ق",
  "ك": "ك",
  "ل": "ل",
  "م": "م",
  "ن": "ن",
  "ه": "هـ",
  "و": "و",
  "ي": "ي",
};

module.exports = function obfuscateArabic(text = "") {
  return text
    .split("")
    .map(char => map[char] || char)
    .join("");
};
